In [56]:
! pip install sqlalchemy
! pip install PyMySQL

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: PyMySQL in c:\users\faeze\appdata\roaming\python\python39\site-packages (1.0.2)

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [57]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # to get the password without showing the input
password = getpass.getpass()

········

Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [58]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

Check the number of rentals for each customer for May

In [59]:
data_may = pd.read_sql_query('select customer_id, count(rental_id) as cnt from rentals_may group by customer_id', engine)
data_may.head()

   customer_id  cnt
0            1    2
1            2    1
2            3    2
3            5    3
4            6    3

Check the number of rentals for each customer for June

In [60]:
data_june = pd.read_sql_query('select customer_id, count(rental_id) as cnt from rentals_june group by customer_id', engine)
data_june.head()

   customer_id  cnt
0            1    7
1            2    1
2            3    4
3            4    6
4            5    5

Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [61]:
data_merged = data_may.merge(data_june, on="customer_id", suffixes=('_may', '_june'))
data_merged

     customer_id  cnt_may  cnt_june
0              1        2         7
1              2        1         1
2              3        2         4
3              5        3         5
4              6        3         4
..           ...      ...       ...
494          594        4         6
495          595        1         2
496          596        6         2
497          597        2         3
498          599        1         4

[499 rows x 3 columns]

custore_id = 5

In [62]:
id = 6
index = data_merged.index[data_merged['customer_id'] == id][0]
print(data_merged.at[index, 'cnt_may'] )
print(data_merged.at[index, 'cnt_june'] )

3
4

In [63]:
def ?

SyntaxError: invalid syntax (1885169875.py, line 1)